// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)
// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)
// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(CP_UTF8);
    return 0;
}
// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)
#include <iostream>
using namespace std;
int main() {
    cout << "hello world!";
    return 0;
} 
// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(CP_UTF8);
    cout << "Лучше " << "гор " << "могут " << "быть " << "только " << "горы " << endl;
    cout << "\tВысота Эльбруса: " << 5642 << " mtr\n";
    cout << "\tВысота Эвереста: " << 8849 << " metr\n";
    cout << "На которых ещё не бывал" << endl;
    return 0;
}
// (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=) ~~ (=^･ω･^=)


